In [41]:
from sklearn.naive_bayes import GaussianNB   #import Gaussian Bayes modeling function
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score
import pandas as pd
import numpy as np

In [42]:
import os
os.getcwd()

'C:\\Users\\GBTC408002ur\\Documents\\lvl2 data\\datasets'

In [43]:
filename = r"./titanic.xls"
df = pd.read_excel(filename)

In [44]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [45]:
df.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [46]:
dfnc = df.drop(['name','cabin','ticket','fare','boat','body','home.dest'], axis=1)

In [47]:
dfnc.head()

   pclass  survived     sex      age  sibsp  parch embarked
0       1         1  female  29.0000      0      0        S
1       1         1    male   0.9167      1      2        S
2       1         0  female   2.0000      1      2        S
3       1         0    male  30.0000      1      2        S
4       1         0  female  25.0000      1      2        S

In [48]:
dfnc['sex'] = dfnc['sex'].map({'female':0, 'male':1})

In [49]:
dfnc.head()

   pclass  survived  sex      age  sibsp  parch embarked
0       1         1    0  29.0000      0      0        S
1       1         1    1   0.9167      1      2        S
2       1         0    0   2.0000      1      2        S
3       1         0    1  30.0000      1      2        S
4       1         0    0  25.0000      1      2        S

In [50]:
dfnc.describe()

,pclass,survived,sex,age,sibsp,parch
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000
mean,2.294882,0.381971,0.644003,29.881135,0.498854,0.385027
std,0.837836,0.486055,0.478997,14.413500,1.041658,0.865560
min,1.000000,0.000000,0.000000,0.166700,0.000000,0.000000
25%,2.000000,0.000000,0.000000,21.000000,0.000000,0.000000
50%,3.000000,0.000000,1.000000,28.000000,0.000000,0.000000
75%,3.000000,1.000000,1.000000,39.000000,1.000000,0.000000
max,3.000000,1.000000,1.000000,80.000000,8.000000,9.000000

In [34]:
dfnc.dtypes.value_counts()

int64      4
float64    2
object     1
dtype: int64

In [ ]:
#dfnc['embarked']=dfnc['embarked'].map('S':0, '':1, '':2)

In [36]:
dfnc['embarked'].unique()

array(['S', 'C', nan, 'Q'], dtype=object)

In [51]:
dfnc.count()

pclass      1309
survived    1309
sex         1309
age         1046
sibsp       1309
parch       1309
embarked    1307
dtype: int64

In [66]:
dfnc.dropna(inplace = True)
dfnc.head()

   pclass  survived  sex      age  sibsp  parch embarked
0       1         1    0  29.0000      0      0        S
1       1         1    1   0.9167      1      2        S
2       1         0    0   2.0000      1      2        S
3       1         0    1  30.0000      1      2        S
4       1         0    0  25.0000      1      2        S

In [67]:
dfnc['embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [69]:
dfnc['embarked']=dfnc['embarked'].map({'S':0, 'C':1, 'Q':2})

In [70]:
dfnc.head()

   pclass  survived  sex      age  sibsp  parch  embarked
0       1         1    0  29.0000      0      0         0
1       1         1    1   0.9167      1      2         0
2       1         0    0   2.0000      1      2         0
3       1         0    1  30.0000      1      2         0
4       1         0    0  25.0000      1      2         0

In [71]:
dfnc.corr()

            pclass  survived       sex       age     sibsp     parch  embarked
pclass    1.000000 -0.318245  0.141624 -0.406095  0.045808  0.015881 -0.114395
survived -0.318245  1.000000 -0.536613 -0.058965 -0.010959  0.115783  0.109340
sex       0.141624 -0.536613  1.000000  0.067410 -0.096829 -0.222810 -0.110041
age      -0.406095 -0.058965  0.067410  1.000000 -0.242910 -0.149993  0.048993
sibsp     0.045808 -0.010959 -0.096829 -0.242910  1.000000  0.374126 -0.030772
parch     0.015881  0.115783 -0.222810 -0.149993  0.374126  1.000000 -0.036104
embarked -0.114395  0.109340 -0.110041  0.048993 -0.030772 -0.036104  1.000000

In [73]:
#dataframe with predicting features
X = dfnc.drop('survived', axis=1)

#column of predictive target values
y = dfnc['survived']

In [74]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=109)

In [76]:
#initialize Gaussian Bayes classifier
gnb = GaussianNB()

In [78]:
#train the model to learn trends
gnb.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [79]:
gnb.score(X_train, y_train)

0.7637292464878672

In [80]:
#test the model on unseen data
#score predictive values in variable
y_pred = gnb.predict(X_test)

In [82]:
#Confusion matrix shows which values model predicted correctly vs incorrectly

cm = pd.DataFrame(
    confusion_matrix(y_test, y_pred),
    columns=['Predicted Failed', 'Predicted Passed'],
    index=['True Failed', 'True Passed']
)

cm

#in the row "True Failed", those are the actuals that failed 
#and 4 predicted that passed however they didn't, i.e., 
#the rows are what actually happenend

             Predicted Failed  Predicted Passed
True Failed               132                33
True Passed                23                73

In [83]:
#frequency of passed students to failed students in the test dataset
y_test.value_counts()

0    165
1     96
Name: survived, dtype: int64

In [84]:
#predictive score of the model on the test data
gnb.score(X_test, y_test)

0.7854406130268199

In [85]:
#import Bernoulli Naïve Bayes function from scikit-learn library
from sklearn.naive_bayes import BernoulliNB

In [86]:
#import Bernoulli Naïve Bayes function from scikit-learn library
from sklearn.naive_bayes import BernoulliNB

In [87]:
#initialize Bernoulli Naïve Bayes function to a variable
bnb = BernoulliNB()

In [88]:
#build the model with training data
bnb.fit(X_train, y_train)

BernoulliNB(alpha=1.0, binarize=0.0, class_prior=None, fit_prior=True)

In [89]:
#model's predictive score on the training data
bnb.score(X_train, y_train)

0.7624521072796935

In [90]:
#test the model on unseen data
#score predictive values in variable
y_pred = bnb.predict(X_test)

In [91]:
#Confusion matrix shows which values model predicted correctly vs incorrectly

cm = pd.DataFrame(
    confusion_matrix(y_test, y_pred),
    columns=['Predicted Failed', 'Predicted Passed'],
    index=['True Failed', 'True Passed']
)

cm

             Predicted Failed  Predicted Passed
True Failed               137                28
True Passed                27                69

In [92]:
#predictive score of the model on the test data
bnb.score(X_test, y_test)

0.789272030651341